package com.example.ebook;

import java.util.Arrays;
import java.util.List;

public class TextBase {
    List<String> book = Arrays.asList(
            " Пролог",
            " ",
            "Каждый со времен Александра Сергеевича знает, что навещать пожилых родственников – не то",
            "чтобы непременный долг, но обязанность воспитанного человека, и Мартин ею не пренебрегал.",
            "Помимо вежливости, ему было по-человечески радостно увидеть дядю, посидеть с ним",
            "на кухне за чашкой кофе и поговорить о чем-нибудь мелком, незначительном, или же, напротив,",
            "– о проблемах философских, разгадка которых человечеством пока не найдена. Была в этих ",
            "регулярных посещениях и еще одна маленькая человеческая приятность – во многих компаниях ",
            "Мартина уже звали по отчеству, чего он ужасно не любил. Да и как русскому человеку ",
            "любить такое нелепое сочетание – Мартин Игоревич? Ну а дядя никогда по отчеству его не ",
            "звал и звать не собирался. В хорошем расположении духа он окликал Мартина Мартом, в",
            "плохом (что, впрочем, случалось нечасто) желчно называл Иденом. Был, видимо, тридцать",
            "с лишним лет назад между дядей и отцом Мартина какой-то суровый родственный спор по ",
            "поводу имени. Сам дядя был закоренелый холостяк, на вопросы о детях сухо отвечал ",
            "«не знаком», но почему-то считал своей законной обязанностью принимать полнейшее участие",
            "в жизни любимого племянника. По сути дела, дядя проиграл лишь один бой – по поводу имени,",
            "зато по всем остальным вопросам ему всегда удавалось настоять на своем. Иногда Мартин ",
            "был за это от души благодарен, например, за сорванные планы учить его с младенчества",
            "игре на фортепьяно, за разрешения отправиться в многодневный поход или поехать с",
            "друзьями в Питер автостопом. Все попытки родителей спорить кончались тяжелым взглядом",
            "из-под бровей и вопросом: «Вы мужика растите или певца эстрадного?» Эстраду дядя и ",
            "впрямь не любил, а из всех певцов уважал лишь Кобзона и Леонтьева, и то виновато",
            "прибавляя: «За голос и характер».",
            " ",
            "Впрочем, при всей суровости характера не лишен был дядя и маленьких человеческих",
            "слабостей, особенно сильно проявившихся в последние десять лет, когда на всей земле ",
            "жизнь пошла наперекосяк.Проснулись в нем дремавшие прежде кулинарные склонности, и ",
            "если раньше мог он прожить целую неделю на яичнице и дешевом пиве, то теперь проводил ",
            "у плиты полдня, а вечерами либо звал к себе гостей, либо сам отправлялся в гости.Мартину",
            "эта слабость нравилась, ибо делала визиты еще приятнее.Вот и сегодня, созвонившись с ",
            "дядей предварительно и выяснив, что на ужин планируется утка Вайдахуньяд, Мартин зашел",
            "в магазин у метро и придирчиво выбрал вино.Конечно же, в данном случае полагалось пить",
            "венгерское.Пусть эстеты и патриоты насмешливо улыбаются, услышав про «венгерское вино»,",
            "пусть одни нахваливают сладковатый сотерн и терпкий тавель, а другие спорят о",
            "сравнительном числе путонов токая в массандровском и венгерском токайском.Мартин же",
            "давно убедился, что к каждой пище есть свой, географией и историей дарованный ",
            "аккомпанемент.К вареной картошечке и малосольной селедочке не придумано ничего лучше",
            "простой русской водки, к пряной бастурме годится густой армянский коньяк(хотя по широте",
    "кавказской души бастурма примет и водочку), к нежным устрицам – белое французское вино,",
            "прохладное и легкое, к жирным и вредным для организма сосискам – чешское или",
            "баварское пиво."
    );

    @Override
    public String toString() {
        return "" + book;
    }
}
